<template>
  <q-page>
    <div class="tw-container">
      <Toolbar class="tw-mb-4" showBack title="Правила программы" />
      <p class="tw-text-t2 tw-text-base tw-mb-4">
        Цель нашей реферальной программы – привлечь как можно больше новых участников в наш проект, а также способствовать активному развитию и росту нашей компании.
      </p>
      <p class="tw-text-t1 tw-font-bold tw-text-base tw-mb-3">
        Правила участия в реферальной программе
      </p>
      <ul class="tw-space-y-2 tw-list-decimal tw-text-t2 tw-text-base tw-pl-5">
        <li>
          Зарегистрируйтесь или войдите в свой аккаунт. Если у вас еще нет аккаунта, создайте его, указав свои данные.
        </li>
        <li>
          После регистрации или авторизации перейдите в раздел “Реферальная программа”.
        </li>
        <li>
          Скопируйте вашу уникальную реферальную ссылку или код приглашения.
        </li>
        <li>
          Поделитесь этой ссылкой или кодом с друзьями, коллегами и знакомыми, которых вы хотели бы пригласить в наше сообщество. Вы можете опубликовать эту ссылку на своих страницах в социальных сетях, отправить по электронной почте или через мессенджеры.
        </li>
        <li>
          Когда ваши друзья перейдут по вашей ссылке и зарегистрируются в нашем проекте, они автоматически станут участниками вашей реферальной группы.
        </li>
      </ul>
    </div>
  </q-page>
</template>

<script setup lang="ts">

</script>
